<template>
  <div class="">
    <div v-if="activeVer == 0">
      <div class="c-d">
        <p class="c-t">更新日志</p>
        <p class="c-p mt30">
          <el-timeline>
            <el-timeline-item :timestamp="item.timestamp" placement="top" v-for="(item, i) of logList" :key="i">
              <template v-if="item.type == 'single'">
                <p>{{ item.inner }}</p>
              </template>
              <template v-else>
                <p v-for="(sitem, si) of item.list" :key="si">
                  {{ sitem }}
                </p>
              </template>
            </el-timeline-item>
          </el-timeline>
        </p>
      </div>
    </div>
    <div v-if="activeVer == 1">
      <div class="c-d">
        <p class="c-t">更新日志</p>
        <p class="c-p mt30">
          <el-timeline>
            <el-timeline-item :timestamp="item.timestamp" placement="top" v-for="(item, i) of logListV8" :key="i">
              <template v-if="item.type == 'single'">
                <p>{{ item.inner }}</p>
              </template>
              <template v-else>
                <p v-for="(sitem, si) of item.list" :key="si">
                  {{ sitem }}
                </p>
              </template>
            </el-timeline-item>
          </el-timeline>
        </p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  components: {},
  props: {
    activeVer: {
      type: Number,
      default: 0
    }
  },
  data() {
    return {
      dataFormat:
        '<?xml version="1.0" encoding="utf-8"?><rss version="5.0"><list page="1" pagecount="23" pagesize="20" recordcount="449"><video><last>2012-05-06 13:32:28</last><id>493</id><tid>9</tid><name><![CDATA[野人来袭]]></name><type>恐怖片</type><dt>qvod</dt><note><![CDATA[]]></note><vlink><![CDATA[http://localhost/maccms7_php/vod/?493.html]]></vlink><plink><![CDATA[http://localhost/maccms7_php/vodplay/?493-1-1.html]]></plink></video></list><class><ty id="1">电影</ty><ty id="2">连续剧</ty><ty id="3">综艺</ty><ty id="4">动漫</ty><ty id="5">动作片</ty><ty id="6">喜剧片</ty><ty id="7">爱情片</ty><ty id="8">科幻片</ty><ty id="9">恐怖片</ty><ty id="10">剧情片</ty><ty id="11">战争片</ty><ty id="12">国产剧</ty><ty id="13">港台剧</ty><ty id="14">日韩剧</ty><ty id="15">欧美剧</ty></class></rss>',
      innerFormat:
        '<?xml version="1.0" encoding="utf-8"?><rss version="5.0"><list page="1" pagecount="1" pagesize="20" recordcount="1"><video><last>2012-05-06 13:32:28</last><id>493</id><tid>9</tid><name><![CDATA[野人来袭]]></name><type>恐怖片</type><pic>http://1img.joykk.com/Uploads/2009/11/30/20091130205750222.JPG</pic><lang>英语</lang><area>欧美</area><year>2012</year><state>0</state><note><![CDATA[]]></note><type>_9</type><actor><![CDATA[]]></actor><director><![CDATA[Ryan Schifrin]]></director><dl><dd from="qvod"><![CDATA[第1集$qvod://206850310|13CB4BC71DD6C3AA5DE0B081E1566992A1BA3F03|野人来袭_01.rmvb|#第2集$qvod://218787599|8E3EA62210F42B9B25EAFA761413587FCC4D8E14|野人来袭_02.rmvb|]]></dd></dl><des><![CDATA[<p>它已经在68个国家被目击了42000次。一个富有传奇色彩的生物，被冠以众多称呼：Yeti(雪人)、Sasquatch(萨斯科奇人)和著名的Bigfoot(大脚怪)！我们已经追捕它了很多年，但是当它决定猎捕我们时，会发生什么？　 <br /><br />　　一个从登山事故中恢复过来的家伙，被困在森林中一个偏僻的小屋里。他看见了传说中的怪物，因此必须在野兽展开血腥袭击前，说服人们相信他并拯救一群大学女生。 <br /></p>]]></des><vlink><![CDATA[http://localhost/maccms7_php/vod/?493.html]]></vlink><plink><![CDATA[http://localhost/maccms7_php/vodplay/?493-1-1.html]]></plink></video></list></rss>',

      logList: [
        {
          timestamp: "2020.1000.2010",
          type: "multiple",
          list: [
            "1. 广告管理，可通过标签调用",
            "2. 防假墙，搜索频次控制，支持1分钟、1小时、24小时级别的控制，后台可配置。",
          ],
        },
        {
          timestamp: '2020.1000.2000',
          type: 'multiple',
          list: [
            '1，player已解密。',
            '2，修复la版本自动更新后门漏洞。',
            '3，增加默认模版。',
            '4，优化多语言支持。',
            '5，优化部分冗余代码。',
            '6，其他细节。'
          ]
        },
        {
          timestamp: '2020.1000.1060',
          type: 'multiple',
          list: [
            '1，修复生成下载页的问题。',
            '2，修复过滤分集剧情html的问题。',
            '3，修复播放器导入跨站攻击的问题。',
            '4，防止上传后门关闭应用中心上传本地插件功能。',
            '5，优化后台登录验证。',
            '6，修复同步图片显示链接的问题。',
            '7，修复后台管理留言搜索的问题。',
            '8，修复词库随机插入语句的问题。',
            '9，修复发送邮件问题。',
            '10，用户中心上传头像支持base64编码方式参数名imgdata。',
            '11，其他细节。'
          ]
        },
        {
          timestamp: '2020.1000.1051',
          type: 'multiple',
          list: ['1，后台+安装界面提示信息支持多简繁体切换。', '2，请参考多语言说明文档可自定义显示信息。', '3，其他细节。']
        },
        {
          timestamp: '2020.1000.1042',
          type: 'multiple',
          list: [
            '1，新增数据库挂马检测功能。',
            '2，新增评论入库接口。',
            '3，角色入库接口支持豆瓣id对应视频。',
            '4，定时任务可以强制执行。',
            '5，支持自定义404页面模板。',
            '6，后台主要操作内容加入token限制，防止跨站攻击。',
            '7，模板编辑保存禁止出现更多关键字。',
            '8，其他细节。'
          ]
        },
        {
          timestamp: '2020.1000.1039',
          type: 'multiple',
          list: [
            '1，新增数据库挂马检测功能。',
            '2，新增评论入库接口。',
            '3，角色入库接口支持豆瓣id对应视频。',
            '4，定时任务可以强制执行。',
            '5，支持自定义404页面模板。',
            '6，后台主要操作内容加入token限制，防止跨站攻击。',
            '7，模板编辑保存禁止出现更多关键字。',
            '8，其他细节。'
          ]
        },
        {
          timestamp: '2020.1000.1035',
          type: 'multiple',
          list: ['1，优化后台数据选择父分类筛选的问题。', '2，分离分集剧情编辑且支持富文本。', '3，邮件配置新增协议选项。', '4，其他细节。']
        },
        {
          timestamp: '2020.1000.1034',
          type: 'multiple',
          list: ['1，修复站群和wap站点冲突的问题。', '2，修复批量操作的问题。', '3，修复ajax接口搜索开关问题。', '4，其他细节。']
        },
        {
          timestamp: '2020.1000.1033',
          type: 'multiple',
          list: [
            '1，修复url推送跳页问题。',
            '2，MacPlayer对象新增Id属性表示当前数据ID。',
            '3，修复默认上传提示未找到类库问题，',
            '4，其他细节。'
          ]
        },
        {
          timestamp: '2020.1000.1032',
          type: 'multiple',
          list: ['1，插件化富文本编辑器功能，方便第三方整合。', '2，修复url推送默认显示配置项问题。', '3，其他细节。']
        },
        {
          timestamp: '2020.1000.1031',
          type: 'multiple',
          list: [
            '1，视频批量管理新增版权设置。',
            '2，修复自定义规则自定义字段的问题。',
            '3，修复文章密码查看的问题。',
            '4，插件化url推送功能，方便第三方开发。',
            '5，插件化email发送功能，方便第三方开发。',
            '6，其他细节。'
          ]
        },
        {
          timestamp: '2020.1000.1029',
          type: 'multiple',
          list: ['1，修复入库接口随机插入语句的问题。', '2，新增站群配置功能。', '3，其他细节。']
        },
        {
          timestamp: '2020.1000.1027',
          type: 'multiple',
          list: [
            '1，修复静态页获取不到vod_plot_list的问题。',
            '2，修复后台编辑模板可写入{php}tp可执行php代码的问题。',
            '3，修复缓存控制问题和非file缓存时多站共用缓存错乱的问题。',
            '4，修复静态生成问题。',
            '5，修复权限验证问题。',
            '6，其他细节。'
          ]
        },
        {
          timestamp: '2020.1000.1025',
          type: 'multiple',
          list: [
            '1，修复评论点顶踩的问题。',
            '2，入库接口中未整合播放下载器类型的数据地址不再入库,并且原来入库的编辑时也不会显示。',
            '3，公共js文件Macplayer新增Sid，Nid两个变量。',
            '4，优化对php7.4的支持。',
            '5，其他细节。'
          ]
        },
        {
          timestamp: '2020.1000.1024',
          type: 'multiple',
          list: [
            '1，上传支持jpeg后缀。',
            '2，修复定时推送网址提示信息。',
            '3，修复缓存时间的问题。',
            '4，优化后台显示样式兼容手机端。',
            '5，网址导航来路统计记录及查看分析。',
            '6，修复前台权限验证的问题。',
            '7，其他细节'
          ]
        },
        {
          timestamp: '2020.1000.1023',
          type: 'multiple',
          list: [
            '1，项目库内不再包含转换数据的插件。',
            '2，新增加阿里巴巴、优启梦图图床插件。',
            '3，接口支持subname副标题入库。',
            '4，修复测试缓存组件连接的问题。',
            '5，修复视频配置独立播放页、下载页模板的问题。',
            '6，其他细节。'
          ]
        },
        {
          timestamp: '2020.1000.1022',
          type: 'multiple',
          list: [
            '1，修复网址反链检测问题。',
            '2，提高后台编辑模板安全性禁止写入php代码。',
            '3，优化后台部分数据管理列表防止xss。',
            '5，修复演员和网址导航模块的权限控制和判断。',
            '6，优化一下默认模板。',
            '7，其他细节。'
          ]
        },
        {
          timestamp: '2020.1000.1021',
          type: 'multiple',
          list: [
            '1，推送加入网址导航模块内容。',
            '2，修复角色同名演员入库问题。',
            '3，修改完整包默认模板首页为帮助提示信息。',
            '4，修复网址导航模块详情页功能。',
            '5，修复邮件发送内容重复名称的问题。',
            '6，优化用户日志接口新增mid和id参数方便调用数据。',
            '7，用户中心可以修改昵称啦字段user_nick_name需修改用户中心模板~~',
            '8，修复ajax接口网址模块的点击量更新、联想搜索、顶踩、评分、接口的问题。',
            '9，修复标签获取网址导航数据量的问题。',
            '10，其他细节。'
          ]
        },
        {
          timestamp: '2020.1000.1020',
          type: 'multiple',
          list: [
            '1，优化详情内容图片链接分析改变的问题。',
            '2，优化友情连接和网址导航的检测反链问题。',
            '3，修复上次更新造成wap端后台错位问题。',
            '4，其他细节。'
          ]
        },
        {
          timestamp: '2020.1000.1019',
          type: 'multiple',
          list: [
            '1，新增分类类型演员和网址导航模块。',
            '2，新增加网址导航模块管理内容及接口。',
            '3，新增演员表分类id、tag、扩展分类等字段。',
            '4，新增api开放接口和入库接口类型支持剧情和网址。',
            '5，新增网址导航火车头入库模块。',
            '6，优化安装操作可选是否创建演示分类数据。',
            '7，其他细节。'
          ]
        },
        {
          timestamp: '2019.1000.1018',
          type: 'multiple',
          list: [
            '1，修复后台已知csrf和xss等可能遇到的问题。',
            '2，修复后台图片管理科夸目录删除文件的问题。',
            '3，修复后台模板管理可创建php文件的问题。',
            '4，修复后台管理员管理可删除自己的问题。',
            '5，修复试看时刷新页面直接能播放的问题。',
            '6，其他细节。'
          ]
        },
        {
          timestamp: '2019.1000.1017',
          type: 'multiple',
          list: [
            '1，新增分类图标、分类封面、分类跳转url等字段。',
            '2，修复演员库收藏点问题。',
            '3，修复用户注册时邮箱手机号可以重复的问题。',
            '4，其他细节。'
          ]
        },
        {
          timestamp: '2019.1000.1016',
          type: 'multiple',
          list: [
            '1，修复后台视频管理中角色显示全部的问题。',
            '2，新增剧情模块的mid和aid数值，方便在模版里判断。',
            '3，新增{$maccms.controller_action}标签，更方便的在模版里判断当前页面访问路径。',
            '4，其他细节。'
          ]
        },
        {
          timestamp: '2019.1000.1015',
          type: 'single',
          inner: '修复上次更新造成采集报错的问题。'
        },
        {
          timestamp: '2019.1000.1014',
          type: 'single',
          inner: '其他细节。'
        },
        {
          timestamp: '2019.1000.1013',
          type: 'single',
          inner: '其他细节。'
        },
        {
          timestamp: '2019.1000.1012',
          type: 'multiple',
          list: [
            '1，新增明星收藏ulog_mid=8，可方便的在用户中心里调用该明星的数据。',
            '2，用户中心新增ulog页面可传入page、limit、mid和type参数筛选数据。',
            '3，修改用户组分类权限字段为text类型，避免分类过多保存不完整的问题。',
            '4，修复自动生成tag的问题。',
            '5，其他细节。'
          ]
        },
        {
          timestamp: '2019.1000.1011',
          type: 'multiple',
          list: [
            '1，自定义资源新增数据操作、地址类型过滤等选项。可方便的控制某个资源只更新入库不新增入库；',
            '2，多组播放器只入库个别类型的资源。',
            '3，其他细节。'
          ]
        },
        {
          timestamp: '2019.1000.1010',
          type: 'multiple',
          list: [
            '1，后台新增seo信息配置可对视频、文章、明星、角色、剧情首页设置seo信息。',
            '2，修复插件配置tip提示信息显示问题。',
            '3，其他细节。'
          ]
        },
        {
          timestamp: '2019.1000.1009',
          type: 'multiple',
          list: [
            '1，修复开启页面缓存后评论留言本等ajax请求失败的问题。',
            '2，修复后台视频和文章管理批量移动分类父分类id不变的问题。',
            '3，其他细节。'
          ]
        },
        {
          timestamp: '2019.00.00.1008',
          type: 'multiple',
          list: [
            '1，新增微信QQ防红防封跳转提示和public/browser.html提示模板。',
            '2，修复分集剧情入库默认值的问题。',
            '3，新增标签$maccms.http_url获取当前网址。',
            '4，其他细节。'
          ]
        },
        {
          timestamp: '2019.00.00.1007',
          type: 'multiple',
          list: [
            '1，视频管理加入独立分集剧情部分、模板和标签项目。 ',
            '2，采集配置二次更新规则加入分集剧情。 ',
            '3，火车头模块加入分集剧情部分。 ',
            '4，其他细节。'
          ]
        },
        {
          timestamp: '2019.00.00.1006',
          type: 'multiple',
          list: ['1，视频采集配置新增地址二更规则。 ', '2，其他细节']
        },
        {
          timestamp: '2019.00.00.1005',
          type: 'multiple',
          list: [
            '1，修复后台插件图片显示问题。 ',
            '2，修复默认模板购买使用积分提示参数错误的问题。',
            '3，修复后台上传视频返回路径的问题。 ',
            '4，修改后台添加会员隐藏上传按钮，编辑时可上传。 ',
            '5，加载系统播放器框架文件player.js,playerconfig.js时加入时间参数如?t=20190805。 ',
            '6，修复二级目录时后台显示前台页面链接错误的问题。 ',
            '7，新加入友情链接检测功能。 ',
            '8，其他细节。'
          ]
        },
        {
          timestamp: '2019.00.00.1004',
          type: 'single',
          inner: '修复视频名称同义词库保存方式和只替换第一个词的问题。'
        },
        {
          timestamp: '2019.00.00.1003',
          type: 'single',
          inner: '采集参数配置新增视频名称同义词替换，可有效减少重名数据'
        },
        {
          timestamp: '2019.00.00.1002',
          type: 'multiple',
          list: ['1，修复静态生成{md5}参数的问题。 ', '2，优化多选项配置切换刷新页面依然选中最后选中项。']
        },
        {
          timestamp: '2019.00.00.1001',
          type: 'multiple',
          list: [
            '1，修复https会员中心上传头像返回地址不对的问题。',
            '2，修复ip注册限制数量的问题。',
            '3，新增一键清理资源库绑定分类功能。',
            '4，视频采集配置二次规格新增总集数和完结状态。',
            '5，修复演员、角色独立模板不起作用的问题。',
            '6，修复采集配置关键词过滤的问题。',
            '7，后台积分日志删除报错的问题。',
            '8，后台专题内容推荐编辑时推荐默认选择的问题。',
            '9，上传视频文件后，前台使用会出现路径的问题。',
            '10，节目周期筛选支持模糊查询。',
            '11，优化by=rnd随机数据标签。',
            '12，播放器新增目标窗口target属性，方便在播放列表控制弹出还是当前页面。',
            '13，其他细节。'
          ]
        },
        {
          timestamp: '2019.03.06.1617',
          type: 'multiple',
          list: [
            '1，修复微信公众号搜索乱码的问题。',
            '2，优化缓存文件处理。',
            '3，优化home.js里的MAC.Ulog.Get方法增加回调函数文档里增加说明。',
            '4，强化站外入库密码安全性判断最低16位起(火车头采集规则密码也要同步改)。',
            '5，由于api.php实现定时任务、站外入库等重要功能。可以修改文件名达到更好的安全效果。',
            '6，其他细节。'
          ]
        },
        {
          timestamp: '2019.02.23.0850',
          type: 'multiple',
          list: [
            '1，修复在线支付回调接口的问题。',
            '2，修复富文本上传图片显示的问题。',
            '3，修复七牛云存储上传的问题。',
            '4，联盟资源库绑定显示本地分类名字。',
            '5，修复联盟资源搜索框回车搜索的问题。',
            '6，新增会员注册IP和IP注册限制。',
            '7，新增视频幕后字段。',
            '8，视频管理列表增加版权、完结筛选项。',
            '9，修复远程图片地址显示的问题。',
            '10，其他细节。'
          ]
        },
        {
          timestamp: '2019.01.19.1001',
          type: 'multiple',
          list: [
            '1，修复三级分销注册关联关系,升级会员组+积分消费分成。',
            '2，修复内容页密码验证提示参数错误的问题。',
            '3，优化支付、附件、短信、登录扩展方式，方便定制插件并且不影响程序升级。',
            '4，用户中心支付页面新增ext_list数据，返回可用支付类型，避免在模板里写死，方便制作模板。',
            '5，修复会员中心提现分页的问题。',
            '6，修复积分消费日志不记录的问题。',
            '7，静态生成分类页面增加调用父分类的{type_pid}{type_pen}。',
            '8，优化用户提现增加冻结资金，提现申请后进入冻结积分，删除或提现成功冻结积分变动。',
            '9，优化启用第三方存储后，后台富文本编辑器显示图片的问题。',
            '10，视频编辑地址的操作增加上传按钮，可上传种子、压缩包、文本、视频等文件。',
            '11，其他细节。'
          ]
        },
        {
          timestamp: '2019.0101.1001',
          type: 'multiple',
          list: [
            '1，优化升级过程中数据库升级处理方法。',
            '2，视频和文章重名数据管理中增加一键删重可保留最小ID或最大ID数据。',
            '3，新增文章付款浏览。',
            '4，新增会员积分变动记录涉及到前台会员中心模板。',
            '5，新增会员积分提现功能涉及到后台配置+前台会员中心模板。',
            '6，新增会员三级分销功能涉及到后台配置+前台会员中心模板。',
            '7，新增文章内容页、视频内容页、播放页、下载页密码访问功能涉及到前台新增加的模板。',
            '8，邮件发送配置新增发件人昵称配置项。',
            "9，修复生成静态获取当前分类ID的问题，把全局变量MAC_TYPE_ID和MAC_TYPE_PID变量修改为$GLOBALS['type_id']和$GLOBALS['type_pid']。",
            '10，新增检测TP框架版本升级提示，避免有些时候大家不注意官方公告没有及时升级。',
            '11，新增视频版权提示和跳转配置，新增vod/copyright.html模板页面可控制跳转提示。',
            '12，新增分类数据转移到另一个分类的功能。',
            '13，修改删除分类时如果其下有数据则无法删除。',
            '14，修复图片水印位置不起作用的问题。',
            '15，新增网址推送定时任务类型。',
            '16，其他细节。'
          ]
        },
        {
          timestamp: '2018.12.13.2151',
          type: 'multiple',
          list: [
            '1，重要TP框架安全更新到5.0.23版本,请手工升级。',
            '2，新增3种富文本编辑器,可在后台配置默认选择(umeditor,kindeditor,ckeditor)整合包需单独下载。',
            '3，home.js中新增短连接生成方法。',
            '4，api开放接口加入缓存处理,提高效率减轻负载。',
            '5，优化一些页面提示信息。',
            '6，修复多个账户重复绑定邮箱或手机号码时不自动解除之前绑定的问题。',
            '7，修复会员推广访问获取积分的问题。',
            '8，其他细节。'
          ]
        },
        {
          timestamp: '2018.12.05.0950',
          type: 'multiple',
          list: [
            '1，最低版本支持php5.5.0。',
            '2，手动编辑视频和文章时新增是否自动生成tag选项。',
            '3，修复前台模板分页输入框某些情况下跳转的问题。',
            '4，修复上一集下一集变量的问题。',
            '5，修复添加专题时没有更新时间的问题。',
            '6，修复用户邮箱验证规则。',
            '7，优化分类管理名称增加链接并显示其下数据量。',
            '8，优化卡密导出选项，可导出最后一次、当天、一周、一月的。',
            '9，其他细节。'
          ]
        },
        {
          timestamp: '2018.11.18.0920',
          type: 'multiple',
          list: [
            '1，修复微信支付二维码显示及回调处理。',
            '2，修复演员库和角色库同步图片。',
            '3，修复播放器序号大于1000时排序的问题。',
            '4，修复保存文章自动提取首图做为图片的问题。',
            '5，修复静态模式下模板中获取当前分类数据的问题。',
            '6，修复批量操作中的遇到问题。',
            '7，修复前台模板中没有public/jump模板时，后台某些操作提示模板不存在的问题。',
            '8，其他细节。'
          ]
        },
        {
          timestamp: '2018.10.31.1340',
          type: 'multiple',
          list: [
            '1，优化api接口支持单独播放器输出。',
            '2，新增附件上传-新浪微博图床接口。',
            '3，新增用户推广访问得积分。',
            '4，新增伪静态路由配置演员ID和角色ID配置项同样支持拼音访问。',
            '5，新增{$maccms.http_type}标签，当前url访问协议，会返回 http:// 或者 https://。',
            '6，修复VIP会员登录状态保持时vip到期不会重置为普通会员的问题。',
            '7，优化导出卡密加入了字段表头和添加时间。',
            '8，优化各标签随机数据获取方法。',
            '9，其他细节。'
          ]
        },
        {
          timestamp: '2018.10.22.1200',
          type: 'multiple',
          list: [
            '1，修复文章站外入库内容没变的情况下不更新的问题。',
            '2，修复后台登录次数的问题。',
            '3，修复定时生成分类时只生成第一个分类的问题。',
            '4，新增定时任务类型-清理缓存。',
            '5，站点配置行能优化新增搜索规则配置，可自定义默认搜索条件查询条件。',
            '6，站点配置预留参数新增自定义参数配置，可自己定义参数，模板里可调用。',
            '7，新增rss及sitemap支持生成多页。',
            '8，优化拼音生成去除符号，避免访问失败。',
            '9，减少微信接口输出条数，避免数量过多返回失败，另外新增返回搜索页面。',
            '10，优化ip获取方式，避免某些情况下登录失败。',
            '11，其他细节。'
          ]
        },
        {
          timestamp: '2018.10.13.1025',
          type: 'multiple',
          list: [
            '1，修复文章站外入库二次更新的问题。',
            '2，修复hck支付回调更新订单的问题。',
            '3，修复部分环境下获取入口文件失败的问题。',
            '4，应对微信公共号最新规则，提供图文(1条)、文字(最多20条)两种返回方案，后台可配置。',
            '5，视频和文章的采集配置二次更新新增了一些选项。',
            '6，其他细节。'
          ]
        },
        {
          timestamp: '2018.10.09.1333',
          type: 'multiple',
          list: [
            '1，修复同步图片地址斜杠的问题。',
            '2，修复采集下载地址更新的问题。',
            '3，充值卡管理增加导出功能。',
            '4，优化站外入库接口返回信息不再转义汉字。',
            '5，优化后台禁止播放器前台模板里不显示该播放器组。',
            '6，新增站点配置网站和手机端logo上传，调用标签{$maccms.site_logo}、{$maccms.site_waplogo}。',
            '7，新增hck支付接口。',
            '8，优化角色入库接口，可选择入库重名判断规则，并修复配置项。',
            '9，优化视频和文章的关联数据，rel参数支持多关键字。',
            '10，修复生成全部内容页只生成第一个分类的问题。',
            '11，默认路由新增明星库筛选页actorshow和角色筛选页roleshow，需要的可参考。',
            '12，其他细节。'
          ]
        },
        {
          timestamp: '2018.09.28.0950',
          type: 'multiple',
          list: [
            '1，新增自定义采集规则定时任务。',
            '2，优化url推送功能。',
            '3，优化actor标签新增starsign、blood参数。',
            '4，修复api接口分类过滤为空时的问题。',
            '5，优化上传路径每目录最多存储999个文件。',
            '6，采集参数配置新增扩展分类优化，默认过滤【片，剧】为空，可以关闭。',
            '7，新增用户注册邮箱验证。',
            '8，新增会员注册验证码、登录验证码开关。',
            '9，修复某些情况下浏览数据提示没有权限的问题。',
            '10，优化ck和dp播放器为iframe载入方式，防止错位(升级包内不提供)。',
            '11，新增采集参数配置：角色采集设置。',
            '12，新增开放api配置：演员API。',
            '13，新增自定义资源库：演员库类型。',
            '14，新增角色站外入库接口，火车头入库模块。',
            '15，其他细节。'
          ]
        },
        {
          timestamp: '2018.09.14.0850',
          type: 'multiple',
          list: [
            '1，修复API接口数据按分类过滤的问题。',
            '2，新增标签comment、gbook自定义pageurl分页参数。',
            '3，新增标签comment、gbook的uid参数，可获取某个用户的数据。',
            '4，新增后台用户管理头像上传。',
            '5，优化后台视频管理播放器、下载器、服务器组按照序号排序。',
            '6，新增百度主动推送、百度熊掌号推送。',
            '7，优化获取头像方法判断头像存不存在返回默认地址。',
            '8，新增短信发送配置（内置腾讯云、阿里云短信发送）。',
            '9，新增用户注册、绑定、找回密码使用手机短信的方式；可在会员设置中开启。',
            '10，修复采集入库介绍随机插入文字的问题。',
            '11，其他细节。'
          ]
        },
        {
          timestamp: '2018.09.03.0920',
          type: 'multiple',
          list: [
            '1，优化actor标签从视频传入name调用数据的排序。',
            '2，优化用户注册后将自动登录。',
            '3，优化动态模式伪静态模式下隐藏后缀也就是目录格式URL。',
            '4，修复后台会员订单管理筛选项。',
            '5，新增后台会员日志、会员订单批量删除和清空。',
            '6，修复模板中mac_url获取vod/show、art/show传入id不起作用的问题。',
            '7，优化会员升级vip会员组后无需重新登录即可享受权限。',
            '8，优化评论加载失败提示信息，无需刷新页面可重新加载。',
            '9，其他细节。'
          ]
        },
        {
          timestamp: '2018.08.25.1120',
          type: 'single',
          inner: '1，紧急修复上个版本分类分页问题。'
        },
        {
          timestamp: '2018.08.24.1355',
          type: 'multiple',
          list: [
            '1，修复首页分页链接跳转还是显示第一页内容的问题。',
            '2，修复视频重名管理筛选项不起作用的问题。',
            '3，修复视频文章筛选页面拼音id的问题。',
            '4，播放器配置新增宽度和高度配置支持px像素和%百分比设置，默认按100%。',
            '5，修复生成静态页面url目录格式的问题。',
            '6，优化采集入库主演、导演重名验证，满足名称重复后（只要其中1个演员或导演）就算是重复数据。',
            '7，所有maccms循环标签，支持offset、length、mod、empty等参数，使用方法参考tp5文档。',
            '8，站点配置新增后台登录验证码开关，可自定义。',
            '9，修复微信对接不支持https域名的问题。',
            '10，新增访问页面触发定时任务方案。',
            '11，修复后台留言本管理选择类型筛选报错的问题。',
            '12，修复后台一处删除任意文件的问题。',
            '13，修复文章管理中内容上移下移的问题。',
            '14，标签vod新增参数isend查询是否完结的数据。',
            '15，其他细节。'
          ]
        },
        {
          timestamp: '2018.08.14.0955',
          type: 'multiple',
          list: [
            '1，修复分页按钮GO跳转的问题。',
            '2，修复会员推荐链接注册推广者无积分收入的问题。',
            '3，修复定时任务测试和执行跳过的问题。',
            '4，修复生成充值卡在某些mysql环境下报错的问题。',
            '5，修复自定义采集分类采规则导致提示分类跳过的问题。',
            '6，修复微信公共号接口关键字搜索返回空的问题。',
            '7，修复获取专题、明星库、角色库今日更新数量总数量的问题。',
            '8，修复安装sql脚本避免在某些mysql环境下安装失败的问题。',
            '9，其他细节。'
          ]
        },
        {
          timestamp: '2018.07.29.1010',
          type: 'multiple',
          list: [
            '1，修复资源采集时未采集数据也会显示同步图片地址的问题。',
            '2，修复专题信息里的自动收录tag和id同时起作用。',
            '3，修复开放API条件筛选不起作用的问题。',
            '4，生成充值卡新增卡号和密码复杂程度选项。',
            '5，修复自带联想搜索插件第二次输入文字不起作用的问题。',
            '6，其他细节。'
          ]
        },
        {
          timestamp: '2018.06.29.1425',
          type: 'multiple',
          list: [
            '1，actor、art、role、vod标签pageurl参数支持自定义页面分页。',
            '2，调整rnd随机排序的缓存方式。',
            '3，修复生成文章当日数据无限循环的问题。',
            '4，新增分类扩展配置信息权限项，避免非 创始人管理员，添加数据时无法获取扩展信息的问题。',
            '5，后台视频筛选项新增地区、语言。',
            '6，修复后台站点设置保存后，邮件配置消失的问题。',
            '7，新增神马搜索Sitemap。',
            '8，其他细节。'
          ]
        },
        {
          timestamp: '2018.06.15.0910',
          type: 'multiple',
          list: [
            '1，修复留言本xss脚本的问题。',
            '2，新增pathinfo分隔符设置可自定义非静态模式下访问url。',
            '3，actor标签新增name参数，可按名称调用明星信息(例如 name="刘德华,成龙")。',
            '4，role标签新增actor,name参数，可按名称调用角色信息(例如 name="花千骨,黑山老妖"; actor="葛优,范冰冰")。',
            '5，部分标签art,vod,actor,role,type,topic,link增加cachetime参数，可单独设置这一组标签的缓存时间(不设置默认按数据缓存时间)。',
            '6，新增so、sogou、bing的sitemap访问及生成。',
            '7，新增数据权限过滤设置，前台可隐藏没有权限的分类和数据。',
            '8，修复微信接口无数据时返回array的问题。',
            '9，用户中心已加入邮件找回密码。',
            '10，新增用户名注册关键字过滤功能。',
            '11，降低验证码识别难度。',
            '12，其他细节。'
          ]
        },
        {
          timestamp: '2018.06.12.1430',
          type: 'multiple',
          list: [
            '1，修复发布评论的问题。',
            '2，修复积分购买点播记录的问题。',
            '3，调整优化路由处理。',
            '4，新增缓存标识、防止多站共用1个memcached或redis服务时混用的问题。',
            '5，后台专题、留言、评论加入分页。',
            '6，修复生成今日数据一值跳转的问题。',
            '7，修复一键生成内容-》分类-》首页。',
            '8，vod标签新增tv参数可调用电视频道的数据。',
            '9，修复幻兮支付成功后回调接口的问题。',
            '10，优化后台顶部主菜单权限显示。',
            '11，优化后台几个模块的列表入口，防止和前台路由冲突。',
            '12，其他细节。'
          ]
        },
        {
          timestamp: '2018.06.08.1339',
          type: 'multiple',
          list: [
            '1，修复专题标签class,tag支持参数。',
            '2，修复qq一键登录的问题。',
            '3，调整微信支付接口返回二维码，并增加对应模板。',
            '4，调整后台评论管理显示关联的视频或文章数据。',
            '5，修复视频标签tag支持参数。',
            '6，新增幻兮支付接口，默认模板已经加入可参考。',
            '7，新增明星库，角色库页面的mid和aid值，已加入标签文档。',
            '8，新增mac_url_content_img函数来处理详情里的图片地址，如使用附件远程存储，mac开头的图片需要转换。',
            '9，开启支持动态页面缓存功能，并新增动态页面缓存时间配置项。',
            '10，修复随机标签rnd在开启缓存的时候每次刷新页面都变的问题。',
            '11，修复评论首页只能调用视频评论的问题。',
            '12，修复linux+nginx环境下部分用户后台搜索汉字换页错误的问题。',
            '13，新增明星库火车头入库接口和模块。',
            '14，其他细节。'
          ]
        },
        {
          timestamp: '2018.06.04.1510',
          type: 'multiple',
          list: [
            '1，修复用户中心播放、下载、收藏记录列表最后一条重复的问题',
            '2，修复用户中心修改信息报错的问题。',
            '3，修复角色、明星标签的相关问题。',
            '4，修复视频批量操作删除播放组、下载组的问题。',
            '5，其他细节。'
          ]
        },
        {
          timestamp: '2018.05.30.1007',
          type: 'multiple',
          list: [
            '1，修复生成视频文章详情页面自定义模板不起作用的问题',
            '2，修改分类生成规则，父分类也可以多页。',
            '3，修复生成当日数据的问题。',
            '4，修改无权限提示页跳转到用户中心。',
            '5，修复会员中心播放记录的问题。',
            '6，修复压缩页面代码功能。',
            '7，新增附件FTP存储功能。',
            '8，其他细节。'
          ]
        },
        {
          timestamp: '2018.05.22.1338',
          type: 'multiple',
          list: [
            '1，修复视频批量操作设置积分的问题',
            '2，修复评论顶踩的问题。',
            '3，修复生成rss、xml后缀问题',
            '4，修复自定义页面动态模式下链接的问题',
            '5，修复专题列表设置推荐值的问题',
            '6，修复文章内容页面调用MAC_TYPE_PID的问题',
            '7，修复https下后台联盟资源库不显示的问题',
            '8，新增后台视频筛选增加空播放器下载器查询',
            '9，新增mac_friend_date函数，返回友好时间提示比如几分前，几小时前，几天前',
            '10，新增视频、文章、专题标签参数timeadd,timehits,time,hitsmonth,hitsweek,hitsday,hits来调用时间和点击量相关数据',
            '11，新增视频标签参数version资源版本,state资源类型,rel关联数据',
            '12，新增站点设置-性能优化-采集时间间隔设置项',
            '13，其他细节。'
          ]
        },
        {
          timestamp: '2018.05.17.1050',
          type: 'multiple',
          list: [
            '1，优化后台快捷菜单链接生成方式。',
            '2，修复自定义页面伪静态路由的问题。',
            '3，增加容错机制避免提示控制器不存在，方法不存在，统一跳入404提示页面。',
            '4，修复评论标签有二级回复的时候一级会多出空白行的问题。',
            '5，修复筛选参数年代区间的问题支持1990-2000或2000-1990格式。',
            '6，修复显示断点采集。',
            '7，其他细节。'
          ]
        },
        {
          timestamp: '2018.05.15.1403',
          type: 'multiple',
          list: [
            '1，新增采集参数配置，随机顶踩。',
            '2，视频筛选参数加入节目周期。',
            '3，专题新增tag参数，自动调用相同tag的视频文章。',
            '4，站点配置自适应改为单域名、多域名、不同方式自适应。',
            '5，修复{$maccms.path_ads}标签没有值的问题。',
            '6，其他细节。'
          ]
        },
        {
          timestamp: '2018.05.11.2300',
          type: 'multiple',
          list: [
            '1，修复添加广告位代码的问题。',
            '2，修改播放器管理纯数字编码会自动加入_，避免删除修改不了。',
            '3，修复https后台不显示官网升级信息、豆瓣信息等api调用的问题。',
            '4，修改会员注册名长度必须6位及以上。',
            '5，其他细节。'
          ]
        },
        {
          timestamp: '2018.05.09.1320',
          type: 'multiple',
          list: [
            '1，修复定时任务采集第二页报错的问题。',
            '2，优化采集入库更新判断项目，更新时间的问题。',
            '3，优化后台视频列表显示，加入显示连载数，备注信息。',
            '4，修复会员部分操作返回值。',
            '5，新加入了广告位管理，默认为当前模板的ads目录，可在模板目录中创建info.ini来单独设置adsdir广告目录。',
            '6，其他细节。'
          ]
        },
        {
          timestamp: '2018.05.08.2020',
          type: 'multiple',
          list: [
            '1，修复拼音ID访问时，分类页面数据问题。',
            '2，修复采集数据时，无更新内容时更新时间的问题。',
            '3，修复bmp，webp图片加水印缩略图报错的问题。',
            '4，新增mac_get_user_portrait函数获取用户头像地址的方法。',
            '5，其他细节。'
          ]
        },
        {
          timestamp: '2018.05.07.1213',
          type: 'multiple',
          list: [
            '1，会员中心新增绑定邮箱功能，绑定后可用邮箱登录。',
            '2，修改播放器管理排列顺序显示顺序都是按排序号倒序排列。',
            '3，修改会员中心上传头像存储和命名规则。',
            '4，修改生成拼音方法自动过滤空格等特殊符号影响url访问。',
            '5，屏蔽调式模式，避免路径泄露。',
            '6，其他细节。'
          ]
        },
        {
          timestamp: '2018.05.04.1320',
          type: 'multiple',
          list: [
            '1，新增定时任务管理。',
            '2，新增播放器导出导入功能。',
            '3，修复采集时同步图片的问题。',
            '4，修改admin.php入口文件，防止路由规则影响后台访问。',
            '5，修复编辑模板遇到包含textarea文本框的时候错乱的问题。',
            '6，修复非静态模式下调用会员$user标签的问题。',
            '7，修复搜索开关、搜索时间间隔的问题。',
            '8，修复播放地址混用播放类型不起作用的问题。',
            '9，其他细节。'
          ]
        },
        {
          timestamp: '2018.05.03.0000',
          type: 'multiple',
          list: [
            '1，修复游客有播放页权限还进入试看的问题。',
            '2，优化后台视频、文章、专题列表显示浏览。',
            '3，优化视频信息维护页面，播放组和下载组加入校正、排序、去前缀功能。',
            '4，优化标签加入half，用于分页数字链接显示个数。',
            '5，其他细节。'
          ]
        },
        {
          timestamp: '2018.05.02.1005',
          type: 'multiple',
          list: [
            '1，修复友情链接按type调用的问题。',
            '2，加强采集xml资源库的兼容性，修复json资源库请求问题。',
            '3，修复下载页面积分购买处理方式及模板。',
            '4，优化安装页面。',
            '5，其他细节。'
          ]
        },
        {
          timestamp: '2018.05.01',
          type: 'single',
          inner: '公测开启，前期问题可能较多，有问题及时上报！'
        },
        {
          timestamp: '2018.04.02',
          type: 'single',
          inner: '内部测试工作基本完成，待完善一些细节后，就准备公开测试了！'
        },
        {
          timestamp: '2018.03.21',
          type: 'single',
          inner: '内部测试工作稳定进行中，程序已基本稳定，模板标签页已基本固定。 下一步主要进行行能优化、兼容性优化。'
        },
        {
          timestamp: '2018.03.15',
          type: 'single',
          inner: '开启第一轮内部测试工作。。。'
        }
      ],
      logListV8: [
        {
          timestamp: '2020.1026',
          type: 'multiple',
          list: ['1，加强后台表单token安全验证，防止跨站攻击。', '2，修复支持php7.2+。', '3，优化后台挂马清理功能。', '4，其他细节。']
        },
        {
          timestamp: '2020.1023',
          type: 'multiple',
          list: [
            '1，新增全局解析接口配置和player/parse.js文件。',
            '2，新增独立解析接口配置。',
            '3，优化播放器代码player.js,playerconfig.js.bak务必替换并更新缓存。',
            '4，优化点击量更新。',
            '5，其他细节'
          ]
        },
        {
          timestamp: '2020.1022',
          type: 'multiple',
          list: ['1，优化mysql5.7+安装问题。', '2，优化php7.2+使用问题。', '3，其他细节。']
        },
        {
          timestamp: '2020.1021',
          type: 'multiple',
          list: ['1，修复站群模式下页面缓存冲突的问题。', '2，其他细节。']
        },
        {
          timestamp: '2020.1018',
          type: 'multiple',
          list: ['1，新增memcached缓存配置。', '2，入库接口支持subname副标字段入库。', '3，其他细节。']
        },
        {
          timestamp: '2020.1017',
          type: 'multiple',
          list: ['1，修复选择多个数据操作失败的问题。', '2，安装时默认站外入库密码改为随机10位。', '3，其他细节']
        },
        {
          timestamp: '2020.1015',
          type: 'multiple',
          list: [
            '1，修复生成的拼音中丢失数字的问题。',
            '2，优化if标签解析防止死循环。',
            '3，优化采集入库过滤防止if标签入库(后台和定时任务)。',
            '4，优化后台参数配置-常用新增安全过滤字段功能配置，改为默认开启状态。',
            '5，优化后台挂马检测清理新型if后门。',
            '6，其他细节。'
          ]
        },
        {
          timestamp: '2020.1010',
          type: 'multiple',
          list: ['1，修复preg_match另一个原因引起的注入问题。', '2，其他细节。']
        },
        {
          timestamp: '2020.1006',
          type: 'multiple',
          list: [
            '1，修复上次升级在线更新导致低版本php报错的问题。',
            '2，加强后台安全限制防止写入不安全内容。',
            '3，前台标签和api接口将自动过滤html和if标签。',
            '4，其他细节。'
          ]
        },
        {
          timestamp: '2019.1003',
          type: 'multiple',
          list: ['1，修复php函数preg_match字符串过长引起的安全过滤脚本失效的问题。', '2，其他细节。']
        },
        {
          timestamp: '2019.1002',
          type: 'multiple',
          list: ['1，修复自动生成tag的问题。', '2，其他细节。']
        },
        {
          timestamp: '2019.1001',
          type: 'multiple',
          list: ['1，修改更新服务地址。', '2，新增加自定义资源库管理。', '3，整合站群插件。', '4，其他细节']
        },
        {
          timestamp: '2018.10.30',
          type: 'multiple',
          list: ['1，优化数据库挂马清理功能。', '2，视频编辑页面新增获取豆瓣数据信息。', '3，微信对接新增返回搜索页面。', '4，其他细节。']
        },
        {
          timestamp: '2018.10.13',
          type: 'multiple',
          list: [
            '1，应对微信公共号最新规则，提供图文(1条)、文字(最多20条)两种返回方案，后台可配置。',
            '2，修复后台https时不显示官方更新提示的问题。',
            '3，其他细节。'
          ]
        },
        {
          timestamp: '2018.10.08',
          type: 'multiple',
          list: [
            '1，修复使用远程存储图片时微信接口显示图片的问题，并且本地图片自适应http和https协议。',
            '2，优化后台数据库挂马检测功能。',
            '3，修复定时任务边采集边同步图片的问题。',
            '4，其他细节。'
          ]
        },
        {
          timestamp: '2018.09.25',
          type: 'multiple',
          list: [
            '1，修复部分环境下配置定时任务报错的问题。',
            '2，新增json格式api接口v10可用。',
            '3，修复上个版本边采集边同步图片有时候会重复的问题。',
            '4，新增数据库挂马代码检测功能，可减轻新手查杀数据库挂马的工作。',
            '5，其他细节。'
          ]
        },
        {
          timestamp: '2018.09.18',
          type: 'multiple',
          list: ['1，调整API解析xml的方式增强兼容性。', '2，更新安全拦截脚本。', '3，其他细节。']
        },
        {
          timestamp: '2018.09.13',
          type: 'multiple',
          list: [
            '1，调整将所有展示到模板里的数据名称过滤掉html元素展示，减少挂马影响，包括分类名、专题名等等。',
            '2，很多站长还在用18年之前的版本，鉴于安全考虑，请更新到最新版本。',
            '3，其他细节。'
          ]
        },
        {
          timestamp: '2018.08.10',
          type: 'multiple',
          list: ['1，累积性更新。', '2，其他细节。']
        },
        {
          timestamp: '2018.02.04',
          type: 'multiple',
          list: ['1，修改采集资源库时将过滤html避免被挂暗链。', '2，修改入口文件逻辑判断。', '3，其他细节。']
        },
        {
          timestamp: '2017.09.27',
          type: 'multiple',
          list: ['1，修复采集插件兼容性问题。', '2，其他细节。']
        },
        {
          timestamp: '2017.06.26',
          type: 'multiple',
          list: [
            '1，修复自动生成tags的问题。',
            '2，修复生成静态页面和定时生成当天数据的问题。',
            '3，优化安全过滤，防止误拦截。',
            '4，其他细节。'
          ]
        },
        {
          timestamp: '2017.05.05',
          type: 'multiple',
          list: ['1，全面支持PHP7+内核，运行速度更快。', '2，优化安全过滤，防止误拦截。', '3，其他细节。']
        },
        {
          timestamp: '2017.04.30',
          type: 'multiple',
          list: ['1，优化程序安全过滤，增强防范，减少误拦截。', '2，其他细节。']
        },
        {
          timestamp: '2017.04.07',
          type: 'multiple',
          list: [
            '1，播放器宽度支持自适应 0为自适应。',
            '2，增加手机播放器宽度和高度设置。',
            '3，增加手机模板自动显示功能。',
            '4，增加API收费选项。',
            '5，增加微信公共号接口。',
            '6，修复https图片不显示的问题。',
            '7，修复1处安全漏洞，重要！',
            '8，注意：由于新增配置项，更新后请进入后台保存【播放器设置-输入手机播放大小】【站点设置】。'
          ]
        },
        {
          timestamp: '2017.02.04',
          type: 'multiple',
          list: ['1，重要更新，修复一处安全隐患。', '2，优化系统过滤脚本。', '3，修复文章搜索筛选条件不起作用的问题。', '4，其他细节。']
        },
        {
          timestamp: '2017.01.25',
          type: 'multiple',
          list: [
            '1，修复模板解析的一处问题。',
            '2，修复火车头接口的一处问题。',
            '3，为了安全，限制必须修改后台默认admin目录名。',
            '4，其他细节。'
          ]
        },
        {
          timestamp: '2016.11.30',
          type: 'multiple',
          list: [
            '1，搜索支持副标题模糊查询。',
            '2，url的参数自动去除前后空格。',
            '3，火车头发布数据自动生成html静态文件。',
            '4，修复联盟资源采集，火车头采集不覆盖图片的问题。',
            '5，其他细节'
          ]
        },
        {
          timestamp: '2015.05.30',
          type: 'multiple',
          list: ['1，修复重要安全补丁，请务必更新！。', '2，修复上次更新出现的问题。']
        },
        {
          timestamp: '2015.05.23',
          type: 'multiple',
          list: ['1，累计更新修复部分bug。', '2，优化安全脚本，增强sql注入检测拦截，增强安全性。']
        },
        {
          timestamp: '2015.04.10',
          type: 'multiple',
          list: [
            '1，优化部分sql语句，提高查询效率。',
            '2，优化vod、art的similar参数，可按name调用相似数据，可在视频调用相似名称的文章。',
            '3，优化静态生成功能，避免显示超时。',
            '4，修改播放器禁用后前台不显示播放组，后台显示【禁用】字样。',
            '5，增加泥巴影音播放器。',
            '6，增加[vod:classname]调用剧情分类，只显示名称。',
            '7，修复已知BUG。',
            '8，其他细节的调整。',
            '9，注意：更新完毕后，请点击【 更新数据缓存 】。'
          ]
        },
        {
          timestamp: '2015.02.09',
          type: 'multiple',
          list: [
            '1，修复vod标签topic参数解析失败的问题。',
            '2，修复用户组权限判断的问题。',
            '3，修复后台编辑视频，可看用户组显示不正确的问题。',
            '4，修复用户推广可以刷分的问题。',
            '5，修复开启缓存时文章分页只显示第一页内容的问题。',
            '6，新增vod标签调用相似相关数据的similar参数，支持tag、主演、导演。',
            '7，优化站外入库脚本，增强容错能力。',
            '8，采集参数配置二次更新规则增加副标题选项。',
            '9，其他细节的调整。'
          ]
        },
        {
          timestamp: '2015.01.24',
          type: 'multiple',
          list: [
            '1，修复自定义视频和文章首页静态文件名不启作用的问题。',
            '2，修复同步远程图片每目录保存500文件不启作用的问题。',
            '3，修复定时生成脚本xml和rss报错的问题。',
            '4，修复保存统计代码的问题。',
            '5，集数列表标签(play,down)更新，支持多组播放器并排横版排列模式，参数type=mode2。',
            '6，其他细节的调整。'
          ]
        },
        {
          timestamp: '2014.12.02',
          type: 'multiple',
          list: ['1，修复前台某些操作提示quote的错误。', '2，修复播放页面评论显示的问题。', '3，其他细节的调整。']
        },
        {
          timestamp: '2014.11.17',
          type: 'multiple',
          list: ['1，增强安全性，修复某个sql注入漏洞。', '2，其他细节的调整。']
        },
        {
          timestamp: '2014.11.07',
          type: 'multiple',
          list: [
            '1，新增播放地址和下载地址区域的批量上传附件功能。',
            '2，修复[vod:playfrom][vod:playshow]标签显示的问题。',
            '3，修复更新采集和定时采集文件。',
            '4，评论管理点击显示所属数据。',
            '5，后台登录验证由cookie改为session。'
          ]
        },
        {
          timestamp: '2014.10.18',
          type: 'multiple',
          list: [
            '1，新增肥佬影音、非凡影音播放器。',
            '2，更新采集类型转换，避免联盟资源库采集的数据播放类型转换失败。',
            '3，更新定时任务采集脚本，支持采集多页。',
            '4，link、 menu 、class 标签支持num参数（限制调用数量）。',
            '5，其他细节的调整。'
          ]
        },
        {
          timestamp: '2014.10.10',
          type: 'multiple',
          list: [
            '1，修复 搜狐，搜狐高清，风行，pptv 播放器。',
            '2，新增迅雷看看调用看看客户端播放器。',
            '3，更新360防护脚本，修复一个sleep函数注入引发mysql拒绝服务的漏洞。',
            '4，其他细节的调整。'
          ]
        },
        {
          timestamp: '2014.09.21',
          type: 'multiple',
          list: [
            '1，修复后台视频管理地区和语言筛选的问题。',
            '2，修复用户中心密码可以为空的问题。',
            '3，修复视频下载地址服务器组无法保存的问题。',
            '4，其他细节的调整。'
          ]
        },
        {
          timestamp: '2014.08.30',
          type: 'multiple',
          list: ['1，修复静态生成当天文章提示无数据的问题。', '2，修复搜索页面的一个sql注入漏洞。', '3，其他细节的调整。']
        },
        {
          timestamp: '2014.08.09',
          type: 'multiple',
          list: [
            '1，修复备份数据库无法备份class剧情分类表的问题。',
            '2，修复开启缓存后剧情分类筛选显示同样内容的问题。',
            '3，其他细节的调整。'
          ]
        },
        {
          timestamp: '2014.07.18',
          type: 'multiple',
          list: ['1，修复一个xss跨站脚本漏洞。', '2，修改播放器代码，避免被360拦截。']
        },
        {
          timestamp: '2014.07.16',
          type: 'multiple',
          list: ['1，部分代码细节的调整。']
        },
        {
          timestamp: '2014.07.14',
          type: 'multiple',
          list: ['1，站点配置新增搜索时间间隔配置项。', '2，修复批量生成数据时内容页面会被下载页面覆盖的问题。', '3，其他细节调整。']
        },
        {
          timestamp: '2014.07.06',
          type: 'multiple',
          list: ['1，修复站外入库遇到多个大分类下有重复名称时剧情小分类入库的问题。']
        },
        {
          timestamp: '2014.07.02',
          type: 'multiple',
          list: ['1，修复一个在缓存目录下创建任意目录的漏洞。']
        },
        {
          timestamp: '2014.06.27',
          type: 'multiple',
          list: ['1，优化sql注入防护脚本，防止多个注入漏洞。']
        },
        {
          timestamp: '2014.06.02',
          type: 'multiple',
          list: ['1，部分细节处理。']
        },
        {
          timestamp: '2014.06.01',
          type: 'multiple',
          list: ['1，部分细节处理。']
        },
        {
          timestamp: '2014.05.23',
          type: 'multiple',
          list: [
            '1，紧急修复多个系统漏洞，包含多个SQL注入和后台getshell问题。',
            '2，修复开启自动生成缩略图后部分图片出错的问题。',
            '3，其他细节。'
          ]
        },
        {
          timestamp: '2014.05.14',
          type: 'multiple',
          list: [
            '1，修复调用小分类标签链接不对的问题。',
            '2，增加视频批量操作功能，可批量删除和设置数据。',
            '3，站外入库接口增加剧情分类d_class字段。',
            '4，搜索页面{page:class}修改为{page:classid}。',
            '5，其他细节。'
          ]
        },
        {
          timestamp: '2014.05.10',
          type: 'multiple',
          list: ['1，开放剧情小分类功能。', '2，开源部分代码，方便大家二次开发。', '3，其他细节。']
        },
        {
          timestamp: '2014.05.01',
          type: 'multiple',
          list: [
            '1，修复生成百度、谷歌地图时间不对的问题。',
            '2，修复开启缓存时评论留言本显示的问题。',
            '3，新增{maccms:php type=code} 标签支持页面内嵌入php代码。',
            '4，修复报错功能，在留言管理中可看到。'
          ]
        },
        {
          timestamp: '2014.04.16',
          type: 'multiple',
          list: [
            '1，优化vod和art的day参数，改为day和days两个参数，day调用指定某1天的数据，days调用指定某天以来的数据。',
            '2，新增[vod:playlinks]和[vod:downlinks]标签，可以显示出所有的播放组链接。',
            '3，修复部分环境下数据库管理的备份列表只显示1个的问题。',
            '4，修复qq登陆后，登陆框还是显示登录不切换显示的问题。',
            '5，升级播放地址功能，可在一个播放组里添加不同类型的数据，例如可以在优酷播放组里添加土豆、快播数据。播放地址支持2段或3段格式： 集数名称$播放地址$指定播放类型。',
            '6，新增加西瓜影音和先锋影音播放器。',
            '7，修复迅播gvod播放器。'
          ]
        },
        {
          timestamp: '2014.04.06',
          type: 'multiple',
          list: [
            '1，采集配置增加是否开启随机评分功能。',
            '2，修复恢复分卷数据库的功能。',
            '3，修复联盟资源库采集某些接口地址无法播放的问题。',
            '4，其他细节的调整优化。'
          ]
        },
        {
          timestamp: '2014.03.30',
          type: 'multiple',
          list: [
            '1，修复专题管理没有显示分页的问题。',
            '2，加强留言和评论内容的验证，无中文不可留言。',
            '3，增加是否压缩输出html代码的功能，减少页面大小提高访问速度。',
            '4，其他细节的调整优化。'
          ]
        },
        {
          timestamp: '2014.03.17',
          type: 'multiple',
          list: [
            '1，修复静态生成当天内容的问题。',
            '2，修复多个sql注入漏洞。',
            '3，完善在线更新程序分为3步骤：1，文件更新；2，数据库更新；3，缓存更新。',
            '4，商业版增加剧情小分类功能。',
            '5，播放页静态模式下自动下一集的问题。',
            '6，其他细节。'
          ]
        },
        {
          timestamp: '2014.03.12',
          type: 'multiple',
          list: [
            '1，修复开启缓存后搜索页面显示数据的问题。',
            '2，修复文章内容翻页显示数据的问题。',
            '3，修复文章内容页点击量显示的问题。',
            '4，修复采集入库随机评分的问题。',
            '5，修复部分安全性问题。',
            '6，其他细节。'
          ]
        },
        {
          timestamp: '2014.02.20',
          type: 'multiple',
          list: [
            '1，修复文章内容标签html内容被过滤的问题。',
            '2，修复同步下载图片错乱的问题。',
            '3，修复QQ登录按钮转向到普通注册页面的问题。',
            '4，其他细节。'
          ]
        },
        {
          timestamp: '2014.01.14',
          type: 'multiple',
          list: [
            '1，更新百度、快播、酷播播放器文件，兼容更多浏览器。',
            '2，修复生成分类列表静态页面10页以后分页链接错误的问题。',
            '3，修复播放器管理保存特殊字符转码的问题。',
            '4，其他细节。'
          ]
        },
        {
          timestamp: '2014.01.03',
          type: 'multiple',
          list: [
            '1，更新在线升级文件，支持php5.2和php5.3两个版本程序在线更新。',
            '2，修复文章content,contenttext len参数的问题。',
            '3，修复文章tag标签的问题。',
            '4，修复rewrite规则和配置路径。',
            '5，其他细节。'
          ]
        }
      ]
    };
  },
  computed: {},
  created() {},
  mounted() {},
  watch: {},
  methods: {}
};
</script>

<style scoped lang="less">
/deep/.el-timeline {
  padding-left: 1px;
  .el-timeline-item {
    padding-bottom: 25px;
    .el-timeline-item__tail {
      border-color: #d8d8d8;
    }
    .el-timeline-item__node {
      border: 1px solid #f7502d;
      background: #ffffff;
    }
    .el-timeline-item__wrapper {
      .el-timeline-item__timestamp.is-top {
        padding-top: 2px;
        font-size: 16px;
        font-weight: 500;
        color: #242424;
      }
      .el-timeline-item__content {
        p {
          font-size: 14px;
          color: #596371;
          line-height: 24px;
        }
      }
    }
  }
}
</style>
